In [ ]:
# Make a data frame using the following information.

In [2]:
Name <- c("A", "B", "C", "D", "E", "F")
Bangla <- c(45, 56, 58, 69, 89, 69)
English <- c(85, 47, 96, 23, 58, 46)
Math <- c(89, 78, 96, 48, 85, 69)
Science <- c(60, 45, 96, 36, 78, 96)

In [3]:
Result <- data.frame(Name, Bangla, English, Math, Science)
Result

  Name Bangla English Math Science
1 A    45     85      89   60
2 B    56     47      78   45
3 C    58     96      96   96
4 D    69     23      48   36
5 E    89     58      85   78
6 F    69     46      69   96

In [4]:
fix(Result)

In [5]:
summary(Result)

 Name      Bangla         English           Math          Science
 A:1   Min.   :45.00   Min.   :23.00   Min.   :48.00   Min.   :36.00
 B:1   1st Qu.:56.50   1st Qu.:46.25   1st Qu.:71.25   1st Qu.:48.75
 C:1   Median :63.50   Median :52.50   Median :81.50   Median :69.00
 D:1   Mean   :64.33   Mean   :59.17   Mean   :77.50   Mean   :68.50
 E:1   3rd Qu.:69.00   3rd Qu.:78.25   3rd Qu.:88.00   3rd Qu.:91.50
 F:1   Max.   :89.00   Max.   :96.00   Max.   :96.00   Max.   :96.00

In [6]:
Result[1,]

Result[3,4]

  Name Bangla English Math Science
1 A    45     85      89   60

[1] 96

In [7]:
Result$Math

mean(Result$Math)

min(Result$Math)

summary(Result$Math)

[1] 89 78 96 48 85 69

[1] 77.5

[1] 48

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  48.00   71.25   81.50   77.50   88.00   96.00